[net]
# Testing
#batch=1
#subdivisions=1
# Training
batch=64
subdivisions=8
width=416
height=416
channels=3
momentum=0.9
decay=0.0005
angle=0
saturation = 1.5
exposure = 1.5
hue=.1

learning_rate=0.001
burn_in=1000
max_batches = 500200
policy=steps
steps=400000,450000
scales=.1,.1

[convolutional]
batch_normalize=1
filters=16
size=3
stride=2
pad=1
activation=swish

[convolutional]
batch_normalize=1
filters=16
groups=16
size=3
stride=1
pad=1
activation=relu

[convolutional]
batch_normalize=1
filters=16
size=1
stride=1
pad=0
activation=linear

[shortcut]
from=-3
activation=linear

# Bottleneck 1
[convolutional]
batch_normalize=1
filters=64
size=1
stride=1
pad=0
activation=relu

[convolutional]
batch_normalize=1
filters=64
groups=64
size=3
stride=2
pad=1
activation=relu

[convolutional]
batch_normalize=1
filters=24
size=1
stride=1
pad=0
activation=linear

# Bottleneck 2
[convolutional]
batch_normalize=1
filters=72
size=1
stride=1
pad=0
activation=relu

[convolutional]
batch_normalize=1
filters=72
groups=72
size=3
stride=1
pad=1
activation=relu

[convolutional]
batch_normalize=1
filters=24
size=1
stride=1
pad=0
activation=linear

[shortcut]
from=-4
activation=linear

# Bottleneck 3
[convolutional]
batch_normalize=1
filters=72
size=1
stride=1
pad=0
activation=relu

[convolutional]
batch_normalize=1
filters=72
groups=72
size=5
stride=2
pad=1
activation=relu

[avgpool]

[convolutional]
filters=24
size=1
stride=1
pad=0
activation=relu

[convolutional]
filters=72
size=1
stride=1
pad=0
activation=logistic

[scale_channels]
from=-4

[convolutional]
batch_normalize=1
filters=40
size=1
stride=1
pad=0
activation=linear

# Bottleneck 4
[convolutional]
batch_normalize=1
filters=120
size=1
stride=1
pad=0
activation=relu

[convolutional]
batch_normalize=1
filters=120
groups=120
size=5
stride=1
pad=1
activation=relu

[avgpool]

[convolutional]
filters=32
size=1
stride=1
pad=0
activation=relu

[convolutional]
filters=120
size=1
stride=1
pad=0
activation=logistic

[scale_channels]
from=-4

[convolutional]
batch_normalize=1
filters=40
size=1
stride=1
pad=0
activation=linear

[shortcut]
from=-8
activation=linear

# Bottleneck 5
[convolutional]
batch_normalize=1
filters=120
size=1
stride=1
pad=0
activation=relu

[convolutional]
batch_normalize=1
filters=120
groups=120
size=5
stride=1
pad=1
activation=relu

[avgpool]

[convolutional]
filters=32
size=1
stride=1
pad=0
activation=relu

[convolutional]
filters=120
size=1
stride=1
pad=0
activation=logistic

[scale_channels]
from=-4

[convolutional]
batch_normalize=1
filters=40
size=1
stride=1
pad=0
activation=linear

[shortcut]
from=-8
activation=linear

# Bottleneck 6
[convolutional]
batch_normalize=1
filters=240
size=1
stride=1
pad=0
activation=swish

[convolutional]
batch_normalize=1
filters=240
groups=240
size=3
stride=2
pad=1
activation=swish

[convolutional]
batch_normalize=1
filters=80
size=1
stride=1
pad=0
activation=linear

# Bottleneck 7
[convolutional]
batch_normalize=1
filters=200
size=1
stride=1
pad=0
activation=swish

[convolutional]
batch_normalize=1
filters=200
groups=200
size=3
stride=1
pad=1
activation=swish

[convolutional]
batch_normalize=1
filters=80
size=1
stride=1
pad=0
activation=linear

[shortcut]
from=-4
activation=linear

# Bottleneck 8
[convolutional]
batch_normalize=1
filters=184
size=1
stride=1
pad=0
activation=swish

[convolutional]
batch_normalize=1
filters=184
groups=184
size=3
stride=1
pad=1
activation=swish

[convolutional]
batch_normalize=1
filters=80
size=1
stride=1
pad=0
activation=linear

[shortcut]
from=-4
activation=linear

# Bottleneck 9
[convolutional]
batch_normalize=1
filters=184
size=1
stride=1
pad=0
activation=swish

[convolutional]
batch_normalize=1
filters=184
groups=184
size=3
stride=1
pad=1
activation=swish

[convolutional]
batch_normalize=1
filters=80
size=1
stride=1
pad=0
activation=linear

[shortcut]
from=-4
activation=linear

# Bottleneck 10
[convolutional]
batch_normalize=1
filters=480
size=1
stride=1
pad=0
activation=swish

[convolutional]
batch_normalize=1
filters=480
groups=480
size=3
stride=1
pad=1
activation=swish

[avgpool]

[convolutional]
filters=120
size=1
stride=1
pad=0
activation=relu

[convolutional]
filters=480
size=1
stride=1
pad=0
activation=logistic

[scale_channels]
from=-4

[convolutional]
batch_normalize=1
filters=112
size=1
stride=1
pad=0
activation=linear

# Bottleneck 11
[convolutional]
batch_normalize=1
filters=672
size=1
stride=1
pad=0
activation=swish

[convolutional]
batch_normalize=1
filters=672
groups=672
size=3
stride=1
pad=1
activation=swish

[avgpool]

[convolutional]
filters=168
size=1
stride=1
pad=0
activation=relu

[convolutional]
filters=672
size=1
stride=1
pad=0
activation=logistic

[scale_channels]
from=-4

[convolutional]
batch_normalize=1
filters=112
size=1
stride=1
pad=0
activation=linear

[shortcut]
from=-8
activation=linear

# Bottleneck 12
[convolutional]
batch_normalize=1
filters=672
size=1
stride=1
pad=0
activation=swish

[convolutional]
batch_normalize=1
filters=672
groups=672
size=5
stride=2
pad=1
activation=swish

[avgpool]

[convolutional]
filters=168
size=1
stride=1
pad=0
activation=relu

[convolutional]
filters=672
size=1
stride=1
pad=0
activation=logistic

[scale_channels]
from=-4

[convolutional]
batch_normalize=1
filters=160
size=1
stride=1
pad=0
activation=linear

# Bottleneck 13
[convolutional]
batch_normalize=1
filters=960
size=1
stride=1
pad=0
activation=swish

[convolutional]
batch_normalize=1
filters=960
groups=960
size=5
stride=1
pad=1
activation=swish

[avgpool]

[convolutional]
filters=240
size=1
stride=1
pad=0
activation=relu

[convolutional]
filters=960
size=1
stride=1
pad=0
activation=logistic

[scale_channels]
from=-4

[convolutional]
batch_normalize=1
filters=160
size=1
stride=1
pad=0
activation=linear

[shortcut]
from=-8
activation=linear

# Bottleneck 14
[convolutional]
batch_normalize=1
filters=960
size=1
stride=1
pad=0
activation=swish

[convolutional]
batch_normalize=1
filters=960
groups=960
size=5
stride=1
pad=1
activation=swish

[avgpool]

[convolutional]
filters=240
size=1
stride=1
pad=0
activation=relu

[convolutional]
filters=960
size=1
stride=1
pad=0
activation=logistic

[scale_channels]
from=-4

[convolutional]
batch_normalize=1
filters=160
size=1
stride=1
pad=0
activation=linear

[shortcut]
from=-8
activation=linear

[convolutional]
batch_normalize=1
filters=960
size=1
stride=1
pad=0
activation=swish
