[net]
# Testing
#batch=1
#subdivisions=1
# Training
batch=64
subdivisions=8
width=416
height=416
channels=3
momentum=0.9
decay=0.0005
angle=0
saturation = 1.5
exposure = 1.5
hue=.1

learning_rate=0.001
burn_in=1000
max_batches = 500200
policy=steps
steps=400000,450000
scales=.1,.1

[convolutional]
batch_normalize=1
filters=32
size=3
stride=2
pad=1
activation=relu

[convolutional]
batch_normalize=1
filters=48
size=1
stride=1
pad=0
activation=relu

[convolutional]
batch_normalize=1
filters=48
groups=6
size=3
stride=2
pad=1
activation=relu

[avgpool]

[convolutional]
filters=8
size=1
stride=1
pad=0
activation=relu

[convolutional]
filters=48
size=1
stride=1
pad=0
activation=logistic

[scale_channels]
from=-4

[convolutional]
batch_normalize=1
filters=48
size=1
stride=1
pad=0
activation=relu

[route]
layers=-8

[convolutional]
batch_normalize=1
filters=48
size=1
stride=2
pad=0
activation=linear

[shortcut]
from=-3
activation=relu

[convolutional]
batch_normalize=1
filters=104
size=1
stride=1
pad=0
activation=relu

[convolutional]
batch_normalize=1
filters=104
groups=13
size=3
stride=2
pad=1
activation=relu

[avgpool]

[convolutional]
filters=12
size=1
stride=1
pad=0
activation=relu

[convolutional]
filters=104
size=1
stride=1
pad=0
activation=logistic

[scale_channels]
from=-4

[convolutional]
batch_normalize=1
filters=104
size=1
stride=1
pad=0
activation=relu

[route]
layers=-8

[convolutional]
batch_normalize=1
filters=104
size=1
stride=2
pad=0
activation=linear

[shortcut]
from=-3
activation=relu

[convolutional]
batch_normalize=1
filters=104
size=1
stride=1
pad=0
activation=relu

[convolutional]
batch_normalize=1
filters=104
groups=13
size=3
stride=1
pad=1
activation=relu

[avgpool]

[convolutional]
filters=26
size=1
stride=1
pad=0
activation=relu

[convolutional]
filters=104
size=1
stride=1
pad=0
activation=logistic

[scale_channels]
from=-4

[convolutional]
batch_normalize=1
filters=104
size=1
stride=1
pad=0
activation=relu

[shortcut]
from=-8
activation=relu

[convolutional]
batch_normalize=1
filters=104
size=1
stride=1
pad=0
activation=relu

[convolutional]
batch_normalize=1
filters=104
groups=13
size=3
stride=1
pad=1
activation=relu

[avgpool]

[convolutional]
filters=26
size=1
stride=1
pad=0
activation=relu

[convolutional]
filters=104
size=1
stride=1
pad=0
activation=logistic

[scale_channels]
from=-4

[convolutional]
batch_normalize=1
filters=104
size=1
stride=1
pad=0
activation=relu

[shortcut]
from=-8
activation=relu

[convolutional]
batch_normalize=1
filters=208
size=1
stride=1
pad=0
activation=relu

[convolutional]
batch_normalize=1
filters=208
groups=26
size=3
stride=2
pad=1
activation=relu

[avgpool]

[convolutional]
filters=26
size=1
stride=1
pad=0
activation=relu

[convolutional]
filters=208
size=1
stride=1
pad=0
activation=logistic

[scale_channels]
from=-4

[convolutional]
batch_normalize=1
filters=208
size=1
stride=1
pad=0
activation=relu

[route]
layers=-8

[convolutional]
batch_normalize=1
filters=208
size=1
stride=2
pad=0
activation=linear

[shortcut]
from=-3
activation=relu

[convolutional]
batch_normalize=1
filters=208
size=1
stride=1
pad=0
activation=relu

[convolutional]
batch_normalize=1
filters=208
groups=26
size=3
stride=1
pad=1
activation=relu

[avgpool]

[convolutional]
filters=52
size=1
stride=1
pad=0
activation=relu

[convolutional]
filters=208
size=1
stride=1
pad=0
activation=logistic

[scale_channels]
from=-4

[convolutional]
batch_normalize=1
filters=208
size=1
stride=1
pad=0
activation=relu

[shortcut]
from=-8
activation=relu

[convolutional]
batch_normalize=1
filters=208
size=1
stride=1
pad=0
activation=relu

[convolutional]
batch_normalize=1
filters=208
groups=26
size=3
stride=1
pad=1
activation=relu

[avgpool]

[convolutional]
filters=52
size=1
stride=1
pad=0
activation=relu

[convolutional]
filters=208
size=1
stride=1
pad=0
activation=logistic

[scale_channels]
from=-4

[convolutional]
batch_normalize=1
filters=208
size=1
stride=1
pad=0
activation=relu

[shortcut]
from=-8
activation=relu

[convolutional]
batch_normalize=1
filters=208
size=1
stride=1
pad=0
activation=relu

[convolutional]
batch_normalize=1
filters=208
groups=26
size=3
stride=1
pad=1
activation=relu

[avgpool]

[convolutional]
filters=52
size=1
stride=1
pad=0
activation=relu

[convolutional]
filters=208
size=1
stride=1
pad=0
activation=logistic

[scale_channels]
from=-4

[convolutional]
batch_normalize=1
filters=208
size=1
stride=1
pad=0
activation=relu

[shortcut]
from=-8
activation=relu

[convolutional]
batch_normalize=1
filters=208
size=1
stride=1
pad=0
activation=relu

[convolutional]
batch_normalize=1
filters=208
groups=26
size=3
stride=1
pad=1
activation=relu

[avgpool]

[convolutional]
filters=52
size=1
stride=1
pad=0
activation=relu

[convolutional]
filters=208
size=1
stride=1
pad=0
activation=logistic

[scale_channels]
from=-4

[convolutional]
batch_normalize=1
filters=208
size=1
stride=1
pad=0
activation=relu

[shortcut]
from=-8
activation=relu

[convolutional]
batch_normalize=1
filters=208
size=1
stride=1
pad=0
activation=relu

[convolutional]
batch_normalize=1
filters=208
groups=26
size=3
stride=1
pad=1
activation=relu

[avgpool]

[convolutional]
filters=52
size=1
stride=1
pad=0
activation=relu

[convolutional]
filters=208
size=1
stride=1
pad=0
activation=logistic

[scale_channels]
from=-4

[convolutional]
batch_normalize=1
filters=208
size=1
stride=1
pad=0
activation=relu

[shortcut]
from=-8
activation=relu

[convolutional]
batch_normalize=1
filters=440
size=1
stride=1
pad=0
activation=relu

[convolutional]
batch_normalize=1
filters=440
groups=55
size=3
stride=2
pad=1
activation=relu

[avgpool]

[convolutional]
filters=52
size=1
stride=1
pad=0
activation=relu

[convolutional]
filters=440
size=1
stride=1
pad=0
activation=logistic

[scale_channels]
from=-4

[convolutional]
batch_normalize=1
filters=440
size=1
stride=1
pad=0
activation=relu

[route]
layers=-8

[convolutional]
batch_normalize=1
filters=440
size=1
stride=2
pad=0
activation=linear

[shortcut]
from=-3
activation=relu

[convolutional]
batch_normalize=1
filters=440
size=1
stride=1
pad=0
activation=relu

[convolutional]
batch_normalize=1
filters=440
groups=55
size=3
stride=1
pad=1
activation=relu

[avgpool]

[convolutional]
filters=110
size=1
stride=1
pad=0
activation=relu

[convolutional]
filters=440
size=1
stride=1
pad=0
activation=logistic

[scale_channels]
from=-4

[convolutional]
batch_normalize=1
filters=440
size=1
stride=1
pad=0
activation=relu

[shortcut]
from=-8
activation=relu

[convolutional]
batch_normalize=1
filters=440
size=1
stride=1
pad=0
activation=relu

[convolutional]
batch_normalize=1
filters=440
groups=55
size=3
stride=1
pad=1
activation=relu

[avgpool]

[convolutional]
filters=110
size=1
stride=1
pad=0
activation=relu

[convolutional]
filters=440
size=1
stride=1
pad=0
activation=logistic

[scale_channels]
from=-4

[convolutional]
batch_normalize=1
filters=440
size=1
stride=1
pad=0
activation=relu

[shortcut]
from=-8
activation=relu

[convolutional]
batch_normalize=1
filters=440
size=1
stride=1
pad=0
activation=relu

[convolutional]
batch_normalize=1
filters=440
groups=55
size=3
stride=1
pad=1
activation=relu

[avgpool]

[convolutional]
filters=110
size=1
stride=1
pad=0
activation=relu

[convolutional]
filters=440
size=1
stride=1
pad=0
activation=logistic

[scale_channels]
from=-4

[convolutional]
batch_normalize=1
filters=440
size=1
stride=1
pad=0
activation=relu

[shortcut]
from=-8
activation=relu

[convolutional]
batch_normalize=1
filters=440
size=1
stride=1
pad=0
activation=relu

[convolutional]
batch_normalize=1
filters=440
groups=55
size=3
stride=1
pad=1
activation=relu

[avgpool]

[convolutional]
filters=110
size=1
stride=1
pad=0
activation=relu

[convolutional]
filters=440
size=1
stride=1
pad=0
activation=logistic

[scale_channels]
from=-4

[convolutional]
batch_normalize=1
filters=440
size=1
stride=1
pad=0
activation=relu

[shortcut]
from=-8
activation=relu

[convolutional]
batch_normalize=1
filters=440
size=1
stride=1
pad=0
activation=relu

[convolutional]
batch_normalize=1
filters=440
groups=55
size=3
stride=1
pad=1
activation=relu

[avgpool]

[convolutional]
filters=110
size=1
stride=1
pad=0
activation=relu

[convolutional]
filters=440
size=1
stride=1
pad=0
activation=logistic

[scale_channels]
from=-4

[convolutional]
batch_normalize=1
filters=440
size=1
stride=1
pad=0
activation=relu

[shortcut]
from=-8
activation=relu
