[net]
# Testing
#batch=1
#subdivisions=1
# Training
batch=64
subdivisions=8
width=416
height=416
channels=3
momentum=0.9
decay=0.0005
angle=0
saturation = 1.5
exposure = 1.5
hue=.1

learning_rate=0.001
burn_in=1000
max_batches = 500200
policy=steps
steps=400000,450000
scales=.1,.1

[convolutional]
batch_normalize=1
filters=32
size=3
stride=2
pad=1
activation=swish

[convolutional]
batch_normalize=1
filters=32
groups=32
size=3
stride=1
pad=1
activation=relu6

[convolutional]
batch_normalize=1
filters=16
size=1
stride=1
pad=0
activation=linear

# Bottleneck 1
[convolutional]
batch_normalize=1
filters=96
size=1
stride=1
pad=0
activation=swish

[convolutional]
batch_normalize=1
filters=96
groups=96
size=3
stride=2
pad=1
activation=relu6

[convolutional]
batch_normalize=1
filters=27
size=1
stride=1
pad=0
activation=linear

# Bottleneck 2
[convolutional]
batch_normalize=1
filters=162
size=1
stride=1
pad=0
activation=swish

[convolutional]
batch_normalize=1
filters=162
groups=162
size=3
stride=1
pad=1
activation=relu6

[convolutional]
batch_normalize=1
filters=38
size=1
stride=1
pad=0
activation=linear

[shortcut]
from=-4
activation=linear

# Bottleneck 3
[convolutional]
batch_normalize=1
filters=228
size=1
stride=1
pad=0
activation=swish

[convolutional]
batch_normalize=1
filters=228
groups=228
size=3
stride=2
pad=1
activation=linear

[avgpool]

[convolutional]
batch_normalize=1
filters=19
size=1
stride=1
pad=0
activation=relu

[convolutional]
filters=228
size=1
stride=1
pad=0
activation=logistic

[scale_channels]
from=-4
activation=relu6

[convolutional]
batch_normalize=1
filters=50
size=1
stride=1
pad=0
activation=linear

# Bottleneck 4
[convolutional]
batch_normalize=1
filters=300
size=1
stride=1
pad=0
activation=swish

[convolutional]
batch_normalize=1
filters=300
groups=300
size=3
stride=1
pad=1
activation=linear

[avgpool]

[convolutional]
batch_normalize=1
filters=25
size=1
stride=1
pad=0
activation=relu

[convolutional]
filters=300
size=1
stride=1
pad=0
activation=logistic

[scale_channels]
from=-4
activation=relu6

[convolutional]
batch_normalize=1
filters=61
size=1
stride=1
pad=0
activation=linear

[shortcut]
from=-8
activation=linear

# Bottleneck 5
[convolutional]
batch_normalize=1
filters=366
size=1
stride=1
pad=0
activation=swish

[convolutional]
batch_normalize=1
filters=366
groups=366
size=3
stride=2
pad=1
activation=linear

[avgpool]

[convolutional]
batch_normalize=1
filters=30
size=1
stride=1
pad=0
activation=relu

[convolutional]
filters=366
size=1
stride=1
pad=0
activation=logistic

[scale_channels]
from=-4
activation=relu6

[convolutional]
batch_normalize=1
filters=72
size=1
stride=1
pad=0
activation=linear

# Bottleneck 6
[convolutional]
batch_normalize=1
filters=432
size=1
stride=1
pad=0
activation=swish

[convolutional]
batch_normalize=1
filters=432
groups=432
size=3
stride=1
pad=1
activation=linear

[avgpool]

[convolutional]
batch_normalize=1
filters=36
size=1
stride=1
pad=0
activation=relu

[convolutional]
filters=432
size=1
stride=1
pad=0
activation=logistic

[scale_channels]
from=-4
activation=relu6

[convolutional]
batch_normalize=1
filters=84
size=1
stride=1
pad=0
activation=linear

[shortcut]
from=-8
activation=linear

# Bottleneck 7
[convolutional]
batch_normalize=1
filters=504
size=1
stride=1
pad=0
activation=swish

[convolutional]
batch_normalize=1
filters=504
groups=504
size=3
stride=1
pad=1
activation=linear

[avgpool]

[convolutional]
batch_normalize=1
filters=42
size=1
stride=1
pad=0
activation=relu

[convolutional]
filters=504
size=1
stride=1
pad=0
activation=logistic

[scale_channels]
from=-4
activation=relu6

[convolutional]
batch_normalize=1
filters=95
size=1
stride=1
pad=0
activation=linear

[shortcut]
from=-8
activation=linear

# Bottleneck 8
[convolutional]
batch_normalize=1
filters=570
size=1
stride=1
pad=0
activation=swish

[convolutional]
batch_normalize=1
filters=570
groups=570
size=3
stride=1
pad=1
activation=linear

[avgpool]

[convolutional]
batch_normalize=1
filters=47
size=1
stride=1
pad=0
activation=relu

[convolutional]
filters=570
size=1
stride=1
pad=0
activation=logistic

[scale_channels]
from=-4
activation=relu6

[convolutional]
batch_normalize=1
filters=106
size=1
stride=1
pad=0
activation=linear

[shortcut]
from=-8
activation=linear

# Bottleneck 9
[convolutional]
batch_normalize=1
filters=636
size=1
stride=1
pad=0
activation=swish

[convolutional]
batch_normalize=1
filters=636
groups=636
size=3
stride=1
pad=1
activation=linear

[avgpool]

[convolutional]
batch_normalize=1
filters=53
size=1
stride=1
pad=0
activation=relu

[convolutional]
filters=636
size=1
stride=1
pad=0
activation=logistic

[scale_channels]
from=-4
activation=relu6

[convolutional]
batch_normalize=1
filters=117
size=1
stride=1
pad=0
activation=linear

[shortcut]
from=-8
activation=linear

# Bottleneck 10
[convolutional]
batch_normalize=1
filters=702
size=1
stride=1
pad=0
activation=swish

[convolutional]
batch_normalize=1
filters=702
groups=702
size=3
stride=1
pad=1
activation=linear

[avgpool]

[convolutional]
batch_normalize=1
filters=58
size=1
stride=1
pad=0
activation=relu

[convolutional]
filters=702
size=1
stride=1
pad=0
activation=logistic

[scale_channels]
from=-4
activation=relu6

[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=0
activation=linear

[shortcut]
from=-8
activation=linear

# Bottleneck 11
[convolutional]
batch_normalize=1
filters=768
size=1
stride=1
pad=0
activation=swish

[convolutional]
batch_normalize=1
filters=768
groups=768
size=3
stride=2
pad=1
activation=linear

[avgpool]

[convolutional]
batch_normalize=1
filters=64
size=1
stride=1
pad=0
activation=relu

[convolutional]
filters=768
size=1
stride=1
pad=0
activation=logistic

[scale_channels]
from=-4
activation=relu6

[convolutional]
batch_normalize=1
filters=140
size=1
stride=1
pad=0
activation=linear

# Bottleneck 12
[convolutional]
batch_normalize=1
filters=840
size=1
stride=1
pad=0
activation=swish

[convolutional]
batch_normalize=1
filters=840
groups=840
size=3
stride=1
pad=1
activation=linear

[avgpool]

[convolutional]
batch_normalize=1
filters=70
size=1
stride=1
pad=0
activation=relu

[convolutional]
filters=840
size=1
stride=1
pad=0
activation=logistic

[scale_channels]
from=-4
activation=relu6

[convolutional]
batch_normalize=1
filters=151
size=1
stride=1
pad=0
activation=linear

[shortcut]
from=-8
activation=linear

# Bottleneck 13
[convolutional]
batch_normalize=1
filters=906
size=1
stride=1
pad=0
activation=swish

[convolutional]
batch_normalize=1
filters=906
groups=906
size=3
stride=1
pad=1
activation=linear

[avgpool]

[convolutional]
batch_normalize=1
filters=75
size=1
stride=1
pad=0
activation=relu

[convolutional]
filters=906
size=1
stride=1
pad=0
activation=logistic

[scale_channels]
from=-4
activation=relu6

[convolutional]
batch_normalize=1
filters=162
size=1
stride=1
pad=0
activation=linear

[shortcut]
from=-8
activation=linear

# Bottleneck 14
[convolutional]
batch_normalize=1
filters=972
size=1
stride=1
pad=0
activation=swish

[convolutional]
batch_normalize=1
filters=972
groups=972
size=3
stride=1
pad=1
activation=linear

[avgpool]

[convolutional]
batch_normalize=1
filters=81
size=1
stride=1
pad=0
activation=relu

[convolutional]
filters=972
size=1
stride=1
pad=0
activation=logistic

[scale_channels]
from=-4
activation=relu6

[convolutional]
batch_normalize=1
filters=174
size=1
stride=1
pad=0
activation=linear

[shortcut]
from=-8
activation=linear

# Bottleneck 15
[convolutional]
batch_normalize=1
filters=1044
size=1
stride=1
pad=0
activation=swish

[convolutional]
batch_normalize=1
filters=1044
groups=1044
size=3
stride=1
pad=1
activation=linear

[avgpool]

[convolutional]
batch_normalize=1
filters=87
size=1
stride=1
pad=0
activation=relu

[convolutional]
filters=1044
size=1
stride=1
pad=0
activation=logistic

[scale_channels]
from=-4
activation=relu6

[convolutional]
batch_normalize=1
filters=185
size=1
stride=1
pad=0
activation=linear

[shortcut]
from=-8
activation=linear

[convolutional]
batch_normalize=1
filters=1280
size=1
stride=1
pad=0
activation=swish
